        IDENTIFICATION DIVISION.
        PROGRAM-ID. DOMCODE-RAFFLER.
         AUTHOR. Lucas van Lierop.
        PROCEDURE DIVISION.
            DISPLAY 'Ready to raffle!'.
            STOP RUN.
